---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PropertySubcategoryId
source: html/f12a86c2-d553-3b96-a0fb-17cd48bd4d25.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PropertySubcategoryId Property

"Subcategory"

## Syntax (C#)
```csharp
public static ForgeTypeId PropertySubcategoryId { get; }
```